{
    "TEXT1": "Home",
    "TEXT2": "About Me",
    "TEXT3": "Projects",
    "TEXT4": "Spotify Clone",
    "TEXT5": "Hamburgeria",
    "TEXT6": "Medium Clone",
    "TEXT7": "Epicode Style Quiz",
    "TEXT8": "Car Showroom",
    "TEXT9": "Tasks App",
    "TEXT10": "Netflix Clone",
    "TEXT11": "Epicode Style Social",
    "TEXT12": "<b>FullStack</b> developer with one year of experience, specializing in the design of advanced technological systems. I have honed my skills over the past year at <b>Epicode School</b>, combining in-depth study with intensive hands-on experience on <b>job-oriented projects</b>. My approach emphasizes creativity in designing innovative technological solutions, critical analysis in problem-solving, and a deep intellectual curiosity driving learning and improvement.",
    "TEXT13": "Sometimes science is more of an art form than a science.",
    "TEXT14": "CONTACT ME",
    "TEXT15": "Contact me",
    "TEXT16": "What's your name?",
    "TEXT17": "Type a message:",
    "TEXT18": "Close",
    "TEXT19": "Send",
    "SUCCESS_MESSAGE": "Your message has been sent successfully!",
    "ERROR_MESSAGE": "There was an error sending your message. Please try again.",
    "SHORT_DESCRIPTION1": "An Angular and Spring Java application for a restaurant business with user reservations and employee management.",
    "LONG_DESCRIPTION1": "Hamburgeria is the final project of my full-stack development course at Epicode, developed in 3 weeks with Angular, Spring, and PostgreSQL. The application includes both user and admin sections. For customers, it features an intuitive interface for placing custom burger orders with home delivery. It also includes a point-based loyalty system, where users earn discounts for every 20 euros spent, redeemable after collecting 10 points. Other features include table reservations, a cart system for customizing orders with pricing rules for extra ingredients, and an order history for both deliveries and reservations. On the admin side, the platform offers employee shift management via a calendar, menu management for adding, modifying, or deleting items, and advanced business data queries. Admins also have access to user and employee lists for streamlined operations.",
    "SHORT_DESCRIPTION2": "A Spotify clone website built with HTML, CSS, and JavaScript.",
    "LONG_DESCRIPTION2": "Spotify Clone is my second team project, built in 1 week using HTML, CSS, and JavaScript. This project meticulously replicates a mockup and utilizes a public API to fetch music data. The app allows users to play and pause tracks, adjust the volume, and switch between different songs. It includes detailed pages for both artists and albums. Designed as a one-page application, all functionality is contained within index.html, offering a seamless user experience that mirrors the core features of Spotify.",
    "SHORT_DESCRIPTION3": "A Netflix clone website built with Angular. Full responsive.",
    "LONG_DESCRIPTION3": "Built in just 1 day, this Netflix Clone was one of my first projects developed with Angular, using a db.json file as the database. The app requires users to log in before accessing any features. Once logged in, users can add TV series to their favorites, view detailed pages for each movie, filter content by genre, and manage account settings. A dedicated page for favorites ensures easy access to preferred content.",
    "SHORT_DESCRIPTION4": "A Medium clone website built with HTML, CSS, and JavaScript. Full responsive.",
    "LONG_DESCRIPTION4": "Medium Clone is one of my early projects, completed in just 1 day using HTML, CSS, and JavaScript. The project aimed to faithfully replicate a mockup of the Medium website. The clone features custom animations for the 'M' in the header and a responsive navbar with color transitions, all implemented from scratch. The design is fully responsive, ensuring a seamless experience across different devices.",
    "SHORT_DESCRIPTION5": "An introductory Angular application where I followed the typical Epicode layout for an app that allows task assignment to employees.",
    "LONG_DESCRIPTION5": "Epicode Style Clone is my second Angular project, completed in just 1 day, using a mock API as its database. The app simulates a task management system where Epicode employees can assign tasks to each other and track their completion. Key features include viewing all tasks, filtering by completion status, and accessing a dedicated page that shows all employees along with their assigned tasks. The app also includes a search bar for easy navigation by employee name.",
    "SHORT_DESCRIPTION6": "A responsive social site built with Angular, designed to facilitate student interactions.",
    "LONG_DESCRIPTION6": "Epic Forum is a responsive social platform built in Angular, designed to facilitate interactions among class students. Completed in 1 week, this project uses a simple db.json file as the backend database. The application allows users to access all features, such as writing, editing, and deleting posts, liking posts, leaving comments, and searching for other registered user profiles. Additionally, sample profile pages are available for exploration.",
    "SHORT_DESCRIPTION7": "A themed Epicode quiz website built with HTML, CSS, and JavaScript.",
    "LONG_DESCRIPTION7": "Epicode Style Quiz was one of my first web apps and my first group project, where I acted as team leader. Built entirely with HTML, CSS, and JavaScript, the app simulates the weekly quiz system used during the Epicode course. Users must accept a disclaimer before accessing the quiz, which consists of 10 questions with 4 possible answers each, with 30 seconds per question. At the end of the quiz, the app displays the final score and offers a detailed breakdown of correct and incorrect answers. Additionally, users can provide feedback on a dedicated page.",
    "SHORT_DESCRIPTION8": "An introductory Angular application for a car exhibition website.",
    "LONG_DESCRIPTION8": "Car Showroom was my first Angular project, completed in just 1 day. The app uses a mock API that I populated to manage the data and serves as a car exhibition platform for a showroom. Cars are displayed in categories, and users can search for specific models using a search bar, providing a smooth browsing experience.",
    "TEXT20": "More Details",
    "TEXT21": "Visit Site",
    "URL1" : "https://youtu.be/RlwZRz63Imo",
    "URL2" : "https://youtu.be/EBfnk1Lao1Y",
    "URL3" : "https://youtu.be/SiCpmRlaK4U"
}