{
    "TEXT1": "Home",
    "TEXT2": "Chi Sono",
    "TEXT3": "Progetti",
    "TEXT4": "Spotify Clone",
    "TEXT5": "Hamburgeria",
    "TEXT6": "Medium Clone",
    "TEXT7": "Epicode Style Quiz",
    "TEXT8": "Car Showroom",
    "TEXT9": "Tasks App",
    "TEXT10": "Netflix Clone",
    "TEXT11": "Epicode Style Social",
    "TEXT12": "<b>Sviluppatore FullStack</b> con un anno di esperienza, specializzato nella progettazione di sistemi tecnologici avanzati. Ho affinato le mie competenze nell'ultimo anno presso la <b>Epicode School</b>, combinando uno studio approfondito con un'esperienza pratica intensiva su <b>progetti orientati al lavoro</b>. Il mio approccio enfatizza la creatività nella progettazione di soluzioni tecnologiche innovative, l'analisi critica nella risoluzione dei problemi e una profonda curiosità intellettuale che alimenta l'apprendimento e il miglioramento.",
    "TEXT13": "A volte la scienza è più una forma d'arte che una scienza.",
    "TEXT14": "CONTATTAMI",
    "TEXT15": "Contattami",
    "TEXT16": "Come ti chiami?",
    "TEXT17": "Scrivimi un messaggio:",
    "TEXT18": "Chiudi",
    "TEXT19": "Invia",
    "SUCCESS_MESSAGE": "Il tuo messaggio è stato inviato con successo!",
    "ERROR_MESSAGE": "C'è stato un errore nell'invio del messaggio. Per favore riprova.",
    "SHORT_DESCRIPTION1": "Un'applicazione Angular e Spring Java per un'attività di ristorazione con prenotazioni e gestione dipendenti.",
    "LONG_DESCRIPTION1": "Hamburgeria è il progetto finale del mio corso di sviluppo full-stack presso Epicode, sviluppato in 3 settimane con Angular, Spring e PostgreSQL. L'applicazione include sezioni per utenti e amministratori. Per i clienti, presenta un'interfaccia intuitiva per ordinare hamburger personalizzati con consegna a domicilio. Include anche un sistema di fedeltà basato su punti, dove gli utenti guadagnano sconti per ogni 20 euro spesi, riscattabili dopo aver raccolto 10 punti. Altre caratteristiche includono prenotazioni di tavoli, un sistema di carrello per personalizzare gli ordini con regole di prezzo per ingredienti extra e una cronologia degli ordini per consegne e prenotazioni. Dalla parte amministrativa, la piattaforma offre gestione dei turni dei dipendenti tramite un calendario, gestione del menu per aggiungere, modificare o eliminare elementi e query avanzate sui dati aziendali. Gli amministratori hanno anche accesso alle liste degli utenti e dei dipendenti per operazioni semplificate.",
    "SHORT_DESCRIPTION2": "Un sito clone di Spotify costruito con HTML, CSS e JavaScript.",
    "LONG_DESCRIPTION2": "Spotify Clone è il mio secondo progetto di squadra, realizzato in 1 settimana utilizzando HTML, CSS e JavaScript. Questo progetto replica meticolosamente un mockup e utilizza una API pubblica per recuperare dati musicali. L'app consente agli utenti di riprodurre e mettere in pausa tracce, regolare il volume e passare tra canzoni diverse. Include pagine dettagliate per artisti e album. Progettata come un'applicazione a pagina unica, tutta la funzionalità è contenuta in index.html, offrendo un'esperienza utente fluida che replica le caratteristiche principali di Spotify.",
    "SHORT_DESCRIPTION3": "Un sito clone di Netflix costruito con Angular. Completamente reattivo.",
    "LONG_DESCRIPTION3": "Realizzato in solo 1 giorno, questo Netflix Clone è stato uno dei miei primi progetti sviluppati con Angular, utilizzando un file db.json come database. L'app richiede agli utenti di effettuare il login prima di accedere a qualsiasi funzionalità. Una volta effettuato il login, gli utenti possono aggiungere serie TV ai loro preferiti, visualizzare pagine dettagliate per ciascun film, filtrare contenuti per genere e gestire le impostazioni dell'account. Una pagina dedicata ai preferiti assicura un facile accesso ai contenuti preferiti.",
    "SHORT_DESCRIPTION4": "Un sito clone di Medium costruito con HTML, CSS e JavaScript. Completamente reattivo.",
    "LONG_DESCRIPTION4": "Medium Clone è uno dei miei primi progetti, completato in solo 1 giorno utilizzando HTML, CSS e JavaScript. Il progetto mirava a replicare fedelmente un mockup del sito Medium. Il clone presenta animazioni personalizzate per la 'M' nell'intestazione e una navbar reattiva con transizioni di colore, tutto implementato da zero. Il design è completamente reattivo, garantendo un'esperienza senza soluzione di continuità su diversi dispositivi.",
    "SHORT_DESCRIPTION5": "Un'applicazione Angular introduttiva che segue il layout tipico di Epicode per un'app che consente l'assegnazione di compiti ai dipendenti.",
    "LONG_DESCRIPTION5": "Epicode Style Clone è il mio secondo progetto Angular, completato in solo 1 giorno, utilizzando una mock API come database. L'app simula un sistema di gestione dei compiti in cui i dipendenti di Epicode possono assegnare compiti tra loro e monitorarne il completamento. Le funzionalità principali includono la visualizzazione di tutti i compiti, il filtraggio per stato di completamento e l'accesso a una pagina dedicata che mostra tutti i dipendenti insieme ai compiti assegnati. L'app include anche una barra di ricerca per una navigazione facile per nome dei dipendenti.",
    "SHORT_DESCRIPTION6": "Un'applicazione sociale reattiva costruita con Angular, progettata per favorire l'interazione tra studenti.",
    "LONG_DESCRIPTION6": "Epic Forum è una piattaforma sociale reattiva costruita in Angular, progettata per favorire l'interazione tra studenti della classe. Completato in 1 settimana, questo progetto utilizza un semplice file db.json come database backend. L'applicazione consente agli utenti di accedere a tutte le funzionalità, come scrivere, modificare e eliminare post, mettere mi piace ai post, lasciare commenti e cercare profili di altri utenti registrati. Inoltre, sono disponibili pagine di profilo campione per l'esplorazione.",
    "SHORT_DESCRIPTION7": "Un sito web di quiz a tema Epicode, costruito con HTML, CSS e JavaScript.",
    "LONG_DESCRIPTION7": "Epicode Style Quiz è stata una delle mie prime applicazioni web e il mio primo progetto di gruppo, dove ho agito come team leader. Costruita interamente con HTML, CSS e JavaScript, l'app simula il sistema di quiz settimanali utilizzato durante il corso di Epicode. Gli utenti devono accettare una dichiarazione prima di accedere al quiz. Il quiz è composto da 10 domande con 4 risposte possibili ciascuna, e gli utenti hanno 30 secondi per rispondere a ciascuna domanda. Al termine del quiz, l'app mostra il punteggio finale e offre un'analisi dettagliata delle risposte corrette e sbagliate. Inoltre, gli utenti possono fornire feedback su una pagina dedicata.",
    "SHORT_DESCRIPTION8": "Un'applicazione Angular da un esercizio tematico su un'esposizione di automobili.",
    "LONG_DESCRIPTION8": "Car Showroom è stato il mio primo progetto Angular, costruito in solo 1 giorno. L'app utilizza una mock API, che ho popolato per gestire i dati, e funge da piattaforma di esposizione per le automobili in una concessionaria. Le auto sono visualizzate in categorie e gli utenti possono cercare modelli specifici utilizzando una barra di ricerca, fornendo un'esperienza di navigazione fluida.",
    "TEXT20": "Dettagli",
    "TEXT21": "Visita il sito"
}